:PROPERTIES:
:ID: f71dae68-f21c-4a6c-a7b5-56272c57c185
:END:
#+TITLE: tools

[[file:..][..]]

#+begin_quote
This page is not a document!
It's basically just a place where I put small scripts I want to use.
But the scripts live here, they have a home.

  --- Teodor 2022-10-13
#+end_quote

Some scripts useful for this website.

* All files

Every file in this subdirectory:

#+begin_src shell :exports both :format raw
bb -e '(->> (babashka.fs/glob "." "*")
            (map str)
            (println))'
#+end_src

#+RESULTS:
: (index.html goto_random_page.cljs play.edn index.org)

* CLJS files

Every clojurescript file in this subdirectory:

#+begin_src shell :exports both :format raw
bb -e '(->> (babashka.fs/glob "." "*.cljs")
            (map #(str "/tools/" %))
            (println))'
#+end_src

#+RESULTS:
: (/tools/goto_random_page.cljs)

#+BEGIN_VERSE



#+END_VERSE
